nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_31 (coord V21), U82E[V21]/U9[3]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PERIPHERAL LP_FLEXCOMM0
/*!
 * @brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_SIGNAL P0
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PIN 31U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PIN_MASK (1U << 31U)
/* @} */

/*! @name PIO1_0 (number AD25), U82F[AD25]/U9[4]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PERIPHERAL LP_FLEXCOMM0
/*!
 * @brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_SIGNAL P1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PIN 0U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PIN_MASK (1U << 0U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_DRIVE_33OHM 0x3000u    /*!<@brief Selects transmitter current drive 33ohm */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO7_3 (coord C21), SD_VSELECT
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SD_VSELECT_PERIPHERAL GPIO7         /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SD_VSELECT_SIGNAL GPIO              /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SD_VSELECT_CHANNEL 3                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSDCARDPINS_SD_VSELECT_GPIO GPIO7               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSDCARDPINS_SD_VSELECT_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_INITSDCARDPINS_SD_VSELECT_PORT 7U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SD_VSELECT_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SD_VSELECT_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO7_0 (coord B22), U82L[B22]/U72[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SDHC0_CLK_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SDHC0_CLK_SIGNAL USDHC_CLK          /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SDHC0_CLK_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SDHC0_CLK_PIN 0U                    /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SDHC0_CLK_PIN_MASK (1U << 0U)       /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO7_1 (coord B20), U82L[B20]/U72[C1]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SDHC0_CMD_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SDHC0_CMD_SIGNAL USDHC_CMD          /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SDHC0_CMD_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SDHC0_CMD_PIN 1U                    /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SDHC0_CMD_PIN_MASK (1U << 1U)       /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO7_6 (coord A22), U82L[A22]/U72[D1]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SDHC0_DATA0_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA0_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA0_CHANNEL 0                 /*!<@brief Signal channel */
#define BOARD_INITSDCARDPINS_SDHC0_DATA0_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SDHC0_DATA0_PIN 6U                    /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SDHC0_DATA0_PIN_MASK (1U << 6U)       /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO7_7 (coord A20), U82L[A20]/U72[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SDHC0_DATA1_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA1_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA1_CHANNEL 1                 /*!<@brief Signal channel */
#define BOARD_INITSDCARDPINS_SDHC0_DATA1_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SDHC0_DATA1_PIN 7U                    /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SDHC0_DATA1_PIN_MASK (1U << 7U)       /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO7_9 (coord B23), U82L[B23]/U72[B1]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SDHC0_DATA3_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA3_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA3_CHANNEL 3                 /*!<@brief Signal channel */
#define BOARD_INITSDCARDPINS_SDHC0_DATA3_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SDHC0_DATA3_PIN 9U                    /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SDHC0_DATA3_PIN_MASK (1U << 9U)       /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO7_8 (coord C22), U82L[C22]/U72[A1]
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SDHC0_DATA2_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA2_SIGNAL USDHC_DATA         /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SDHC0_DATA2_CHANNEL 2                 /*!<@brief Signal channel */
#define BOARD_INITSDCARDPINS_SDHC0_DATA2_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SDHC0_DATA2_PIN 8U                    /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SDHC0_DATA2_PIN_MASK (1U << 8U)       /*!<@brief PORT pin mask */
                                                                   /* @} */

