nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
/*! @name PIO7_11 (coord F18), SD_CARD_DET_N
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SD_CARD_DET_N_PERIPHERAL GPIO7          /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SD_CARD_DET_N_SIGNAL GPIO               /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SD_CARD_DET_N_CHANNEL 11                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSDCARDPINS_SD_CARD_DET_N_GPIO GPIO7                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSDCARDPINS_SD_CARD_DET_N_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */
#define BOARD_INITSDCARDPINS_SD_CARD_DET_N_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SD_CARD_DET_N_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SD_CARD_DET_N_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO7_10 (coord A24), SD_PWREN_B
  @{ */
/* Routed pin properties */
#define BOARD_INITSDCARDPINS_SD_PWREN_B_PERIPHERAL GPIO7          /*!<@brief Peripheral name */
#define BOARD_INITSDCARDPINS_SD_PWREN_B_SIGNAL GPIO               /*!<@brief Signal name */
#define BOARD_INITSDCARDPINS_SD_PWREN_B_CHANNEL 10                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSDCARDPINS_SD_PWREN_B_GPIO GPIO7                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSDCARDPINS_SD_PWREN_B_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define BOARD_INITSDCARDPINS_SD_PWREN_B_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDCARDPINS_SD_PWREN_B_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITSDCARDPINS_SD_PWREN_B_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDCardPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_EN 0x0400u    /*!<@brief Pseudo Output Drain is enabled */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_6 (coord P21), U82E[P21]/U31[5]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2CPINS_P0_6_I2C8_SDA_1V8_PERIPHERAL LP_FLEXCOMM8  /*!<@brief Peripheral name */
#define BOARD_INITI2CPINS_P0_6_I2C8_SDA_1V8_SIGNAL P0                /*!<@brief Signal name */
#define BOARD_INITI2CPINS_P0_6_I2C8_SDA_1V8_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2CPINS_P0_6_I2C8_SDA_1V8_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITI2CPINS_P0_6_I2C8_SDA_1V8_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO0_7 (coord P20), U82E[P20]/U31[4]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2CPINS_P0_7_I2C8_SCL_1V8_PERIPHERAL LP_FLEXCOMM8  /*!<@brief Peripheral name */
#define BOARD_INITI2CPINS_P0_7_I2C8_SCL_1V8_SIGNAL P1                /*!<@brief Signal name */
#define BOARD_INITI2CPINS_P0_7_I2C8_SCL_1V8_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2CPINS_P0_7_I2C8_SCL_1V8_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITI2CPINS_P0_7_I2C8_SCL_1V8_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2CPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_EN 0x0400u    /*!<@brief Pseudo Output Drain is enabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCODEC_I2CPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u                   /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u                /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC5 0x05u                       /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_FUNC6 0x06u                       /*!<@brief Selects pin function 6 */
#define IOPCTL_PIO_INBUF_EN 0x40u                    /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u                      /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u                 /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u                 /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u                     /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u            /*!<@brief Normal mode */
#define SAI0_MCLK_CTRL_SAIMCLKDIR_SAIMCLKOEN_1 0x01u /*!<@brief SAI0-2 MCLK Direction Control: Output */

