nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
/*! @name PIO0_0 (coord R24), U82E[R24]/SW10[4]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITI2SPINS_PIO0_0_DBG_OVER_USB_PERIPHERAL SAI0
/*!
 * @brief Signal name */
#define BOARD_INITI2SPINS_PIO0_0_DBG_OVER_USB_SIGNAL RX_BCLK
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_PIO0_0_DBG_OVER_USB_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITI2SPINS_PIO0_0_DBG_OVER_USB_PIN 0U
/*!
 * @brief PORT pin mask */
#define BOARD_INITI2SPINS_PIO0_0_DBG_OVER_USB_PIN_MASK (1U << 0U)
/* @} */

/*! @name PIO0_1 (coord P24), U82E[P24]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI0_RX_SYNC_PERIPHERAL SAI0          /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_RX_SYNC_SIGNAL RX_SYNC           /*!<@brief Signal name */
#define BOARD_INITI2SPINS_SAI0_RX_SYNC_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_RX_SYNC_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_RX_SYNC_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO0_2 (coord T24), U82E[D24]/U29[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI0_RXD0_PERIPHERAL SAI0           /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_RXD0_SIGNAL RXD0               /*!<@brief Signal name */
#define BOARD_INITI2SPINS_SAI0_RXD0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_RXD0_PIN 2U                    /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_RXD0_PIN_MASK (1U << 2U)       /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_3 (coord T25), U82E[T25]/U29[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_PERIPHERAL SAI0           /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_SIGNAL TX_BCLK            /*!<@brief Signal name */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_PIN 3U                    /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_TX_BCLK_PIN_MASK (1U << 3U)       /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO0_4 (coord V25), U82E[V25]/U29[D1]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI0_TXD0_PERIPHERAL SAI0           /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_TXD0_SIGNAL TXD0               /*!<@brief Signal name */
#define BOARD_INITI2SPINS_SAI0_TXD0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_TXD0_PIN 4U                    /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_TXD0_PIN_MASK (1U << 4U)       /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_5 (coord T23), U82E[T23]/U29[D3]
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_PERIPHERAL SAI0           /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_SIGNAL TX_SYNC            /*!<@brief Signal name */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_PIN 5U                    /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_SAI0_TX_SYNC_PIN_MASK (1U << 5U)       /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO0_21 (number AB25), MCLK
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_MCLK_PERIPHERAL CLKCTL0                 /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_MCLK_SIGNAL MCLK                        /*!<@brief Signal name */
#define BOARD_INITI2SPINS_MCLK_PORT 0U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_MCLK_PIN 21U                            /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_MCLK_PIN_MASK (1U << 21U)               /*!<@brief PORT pin mask */
                                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2SPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_10 (coord V23), SW5
  @{ */
/* Routed pin properties */
#define BOARD_INITBUTTONSPINS_SW5_PERIPHERAL GPIO0                  /*!<@brief Peripheral name */
#define BOARD_INITBUTTONSPINS_SW5_SIGNAL GPIO                       /*!<@brief Signal name */
#define BOARD_INITBUTTONSPINS_SW5_CHANNEL 10                        /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW5_GPIO GPIO0                        /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW5_GPIO_PIN_MASK (1U << 10U)         /*!<@brief GPIO pin mask */
#define BOARD_INITBUTTONSPINS_SW5_PORT 0U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW5_PIN 10U                           /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW5_PIN_MASK (1U << 10U)              /*!<@brief PORT pin mask */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

