nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO1_13 (number AD23), LED_GRN
  @{ */
/* Routed pin properties */
#define BOARD_INITLEDSPINS_LED_GRN_PERIPHERAL GPIO1                   /*!<@brief Peripheral name */
#define BOARD_INITLEDSPINS_LED_GRN_SIGNAL GPIO                        /*!<@brief Signal name */
#define BOARD_INITLEDSPINS_LED_GRN_CHANNEL 13                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_GRN_GPIO GPIO1                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_GRN_GPIO_PIN_MASK (1U << 13U)          /*!<@brief GPIO pin mask */
#define BOARD_INITLEDSPINS_LED_GRN_PORT 1U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_GRN_PIN 13U                            /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_GRN_PIN_MASK (1U << 13U)               /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO0_19 (number AB24), LED_BLU
  @{ */
/* Routed pin properties */
#define BOARD_INITLEDSPINS_LED_BLU_PERIPHERAL GPIO0                   /*!<@brief Peripheral name */
#define BOARD_INITLEDSPINS_LED_BLU_SIGNAL GPIO                        /*!<@brief Signal name */
#define BOARD_INITLEDSPINS_LED_BLU_CHANNEL 19                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_BLU_GPIO GPIO0                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_BLU_GPIO_PIN_MASK (1U << 19U)          /*!<@brief GPIO pin mask */
#define BOARD_INITLEDSPINS_LED_BLU_PORT 0U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_BLU_PIN 19U                            /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_BLU_PIN_MASK (1U << 19U)               /*!<@brief PORT pin mask */
                                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO6_1 (coord B2), U82K[B2]/U39[6]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_PERIPHERAL XSPI0         /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_SIGNAL SCLK0             /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_PORT 6U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_SCLK0_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO6_2 (coord H6), U82K[H6]/U39[1]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_SS0_N_PERIPHERAL XSPI0         /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_SS0_N_SIGNAL SS0_N             /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_SS0_N_PORT 6U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_SS0_N_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_SS0_N_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO6_3 (coord F6), U82K[F6]/U39[5]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_DATA0_PERIPHERAL XSPI0         /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA0_SIGNAL DATA              /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA0_CHANNEL 0                /*!<@brief Signal channel */
#define BOARD_INITXSPI0PINS_XSPI0_DATA0_PORT 6U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_DATA0_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_DATA0_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO6_4 (coord B3), U82K[B3]/U39[2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_DATA1_PERIPHERAL XSPI0         /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA1_SIGNAL DATA              /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA1_CHANNEL 1                /*!<@brief Signal channel */
#define BOARD_INITXSPI0PINS_XSPI0_DATA1_PORT 6U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_DATA1_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_DATA1_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO6_5 (coord E8), U82K[E8]/U39[3]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_DATA2_PERIPHERAL XSPI0         /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA2_SIGNAL DATA              /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA2_CHANNEL 2                /*!<@brief Signal channel */
#define BOARD_INITXSPI0PINS_XSPI0_DATA2_PORT 6U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_DATA2_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_DATA2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO6_6 (coord A4), U82K[A4]/U39[7]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI0PINS_XSPI0_DATA3_PERIPHERAL XSPI0         /*!<@brief Peripheral name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA3_SIGNAL DATA              /*!<@brief Signal name */
#define BOARD_INITXSPI0PINS_XSPI0_DATA3_CHANNEL 3                /*!<@brief Signal channel */
#define BOARD_INITXSPI0PINS_XSPI0_DATA3_PORT 6U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI0PINS_XSPI0_DATA3_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI0PINS_XSPI0_DATA3_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitXSPI0Pins(void); /* Function assigned for the Cortex-M33 (Core #0) */

