nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO5_0 (coord K4), U82J[K4]/U81[A3]/U80[1]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_SS0_N_PERIPHERAL XSPI1
/*!
 * @brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_SS0_N_SIGNAL SS0_N
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_SS0_N_PORT 5U
/*!
 * @brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_SS0_N_PIN 0U
/*!
 * @brief PORT pin mask */
#define BOARD_INITXSPI1PINS_XSPI1_SS0_N_PIN_MASK (1U << 0U)
/* @} */

/*! @name PIO5_1 (coord F3), U82J[F3]/U81[D3]/U80[5]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA0_PERIPHERAL XSPI1
/*!
 * @brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA0_SIGNAL DATA
/*!
 * @brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA0_CHANNEL 0
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA0_PORT 5U
/*!
 * @brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA0_PIN 1U
/*!
 * @brief PORT pin mask */
#define BOARD_INITXSPI1PINS_XSPI1_DATA0_PIN_MASK (1U << 1U)
/* @} */

/*! @name PIO5_2 (coord F2), U82J[F2]/U81[D2]/U80[2]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA1_PERIPHERAL XSPI1
/*!
 * @brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA1_SIGNAL DATA
/*!
 * @brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA1_CHANNEL 1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA1_PORT 5U
/*!
 * @brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA1_PIN 2U
/*!
 * @brief PORT pin mask */
#define BOARD_INITXSPI1PINS_XSPI1_DATA1_PIN_MASK (1U << 2U)
/* @} */

/*! @name PIO5_3 (coord H2), U82J[H2]/U81[C4]/U80[3]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA2_PERIPHERAL XSPI1
/*!
 * @brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA2_SIGNAL DATA
/*!
 * @brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA2_CHANNEL 2
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA2_PORT 5U
/*!
 * @brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA2_PIN 3U
/*!
 * @brief PORT pin mask */
#define BOARD_INITXSPI1PINS_XSPI1_DATA2_PIN_MASK (1U << 3U)
/* @} */

/*! @name PIO5_4 (coord J3), U82J[J3]/U81[D4]/U80[7]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA3_PERIPHERAL XSPI1
/*!
 * @brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA3_SIGNAL DATA
/*!
 * @brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA3_CHANNEL 3
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA3_PORT 5U
/*!
 * @brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA3_PIN 4U
/*!
 * @brief PORT pin mask */
#define BOARD_INITXSPI1PINS_XSPI1_DATA3_PIN_MASK (1U << 4U)
/* @} */

/*! @name PIO5_5 (coord G2), U82J[G2]/U81[C3]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DQS0_PERIPHERAL XSPI1         /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DQS0_SIGNAL DQS0              /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DQS0_PORT 5U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DQS0_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DQS0_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO5_6 (coord E3), U82J[E3]/U81[D5]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA4_PERIPHERAL XSPI1         /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA4_SIGNAL DATA              /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA4_CHANNEL 4                /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA4_PORT 5U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA4_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA4_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO5_7 (coord F1), U82J[F1]/U81[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA5_PERIPHERAL XSPI1         /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA5_SIGNAL DATA              /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA5_CHANNEL 5                /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA5_PORT 5U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA5_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA5_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO5_8 (coord H3), U82J[H3]/U81[E2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI1PINS_XSPI1_DATA6_PERIPHERAL XSPI1         /*!<@brief Peripheral name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA6_SIGNAL DATA              /*!<@brief Signal name */
#define BOARD_INITXSPI1PINS_XSPI1_DATA6_CHANNEL 6                /*!<@brief Signal channel */
#define BOARD_INITXSPI1PINS_XSPI1_DATA6_PORT 5U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI1PINS_XSPI1_DATA6_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI1PINS_XSPI1_DATA6_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

