nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO4_0 (coord D16), U82I[D16]/U34[A3]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_SS0_N_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_SS0_N_16_SIGNAL SS0_N              /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_SS0_N_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_SS0_N_16_PIN 0U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_SS0_N_16_PIN_MASK (1U << 0U)       /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO4_1 (coord B10), U82I[D10]/U34[D3]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA0_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA0_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA0_16_CHANNEL 0                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA0_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA0_16_PIN 1U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA0_16_PIN_MASK (1U << 1U)       /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO4_2 (coord C10), U82I[C10]/U34[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA1_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA1_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA1_16_CHANNEL 1                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA1_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA1_16_PIN 2U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA1_16_PIN_MASK (1U << 2U)       /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO4_3 (coord B11), U82I[B11]/U34[C4]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA2_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA2_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA2_16_CHANNEL 2                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA2_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA2_16_PIN 3U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA2_16_PIN_MASK (1U << 3U)       /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO4_4 (coord A10), U82I[A10]/U34[D4]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA3_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA3_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA3_16_CHANNEL 3                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA3_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA3_16_PIN 4U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA3_16_PIN_MASK (1U << 4U)       /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO4_5 (coord A12), U82I[A12]/U34[C3]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DQS0_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DQS0_SIGNAL DQS0               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DQS0_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DQS0_PIN 5U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DQS0_PIN_MASK (1U << 5U)       /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO4_6 (coord C12), U82I[C12]/U34[D5]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA4_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA4_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA4_16_CHANNEL 4                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA4_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA4_16_PIN 6U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA4_16_PIN_MASK (1U << 6U)       /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO4_7 (coord B12), U82I[B12]/U34[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA5_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA5_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA5_16_CHANNEL 5                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA5_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA5_16_PIN 7U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA5_16_PIN_MASK (1U << 7U)       /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO4_8 (coord C13), U82I[C13]/U34[E2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA6_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA6_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA6_16_CHANNEL 6                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA6_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA6_16_PIN 8U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA6_16_PIN_MASK (1U << 8U)       /*!<@brief PORT pin mask */
                                                                     /* @} */

