nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
/*! @name PIO4_9 (coord A14), U82I[A14]/U34[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA7_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA7_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA7_16_CHANNEL 7                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA7_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA7_16_PIN 9U                    /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA7_16_PIN_MASK (1U << 9U)       /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO4_10 (coord B15), U82I[B15]/U34[B2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_SCLK0_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_SCLK0_16_SIGNAL SCLK0              /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_SCLK0_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_SCLK0_16_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_SCLK0_16_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO4_12 (coord C16), U82I[C16]/U34[C2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA8_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA8_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA8_16_CHANNEL 8                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA8_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA8_16_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA8_16_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO4_13 (coord C14), U82I[C14]/U34[B1]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA9_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA9_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA9_16_CHANNEL 9                 /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA9_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA9_16_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA9_16_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO4_14 (coord A16), U82I[A16]/U34[A2]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA10_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA10_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA10_16_CHANNEL 10                /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA10_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA10_16_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA10_16_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO4_15 (coord B16), U82I[B16]/U34[A4]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA11_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA11_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA11_16_CHANNEL 11                /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA11_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA11_16_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA11_16_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO4_16 (coord C17), U82I[C17]/U34[B3]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DQS1_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DQS1_SIGNAL DQS1               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DQS1_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DQS1_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DQS1_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PIO4_17 (coord A18), U82I[A18]/U34[A5]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA12_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA12_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA12_16_CHANNEL 12                /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA12_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA12_16_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA12_16_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO4_18 (coord B19), U82I[B19]/U34[B4]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA13_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA13_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA13_16_CHANNEL 13                /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA13_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA13_16_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA13_16_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO4_19 (coord B18), U82I[B18]/U34[B5]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA14_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA14_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA14_16_CHANNEL 14                /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA14_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA14_16_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA14_16_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

