nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
/*! @name PIO4_20 (coord C18), U82I[C18]/U34[C5]
  @{ */
/* Routed pin properties */
#define BOARD_INITXSPI2PINS_XSPI2_DATA15_16_PERIPHERAL XSPI2          /*!<@brief Peripheral name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA15_16_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITXSPI2PINS_XSPI2_DATA15_16_CHANNEL 15                /*!<@brief Signal channel */
#define BOARD_INITXSPI2PINS_XSPI2_DATA15_16_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITXSPI2PINS_XSPI2_DATA15_16_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITXSPI2PINS_XSPI2_DATA15_16_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitXSPI2Pins(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Analog mux is disabled */
#define IOPCTL_PIO_ANAMUX_DI 0x00u
/*!
 * @brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u
/*!
 * @brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC0 0x00u
/*!
 * @brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_DI 0x00u
/*!
 * @brief Input function is not inverted */
#define IOPCTL_PIO_INV_DI 0x00u
/*!
 * @brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u
/*!
 * @brief Enable pull-down function */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u
/*!
 * @brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u
/*!
 * @brief Normal mode */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u
/*!
 * @brief Input Buffer Enable: Enables */
#define PMIC_I2C_SCL_IBENA_IBENA_1 0x01u
/*!
 * @brief Open-drain Mode Enable: Enables for simulated open-drain output (high drive disabled) */
#define PMIC_I2C_SCL_ODENA_ODENA_1 0x01u
/*!
 * @brief Input Buffer Enable: Enables */
#define PMIC_I2C_SDA_IBENA_IBENA_1 0x01u
/*!
 * @brief Open-drain Mode Enable: Enables for simulated open-drain output (high drive disabled) */
#define PMIC_I2C_SDA_ODENA_ODENA_1 0x01u

/*! @name PMIC_I2C_SCL (number AA14), U82C[AA14]/U35[E5]
  @{ */
/* Routed pin properties */
#define BOARD_INITPMICPINS_PMIC_I2C_SCL_PERIPHERAL LPI2C15         /*!<@brief Peripheral name */
#define BOARD_INITPMICPINS_PMIC_I2C_SCL_SIGNAL SCL                 /*!<@brief Signal name */
                                                                   /* @} */

/*! @name PMIC_I2C_SDA (coord Y14), U82C[Y14]/U35[F5]
  @{ */
/* Routed pin properties */
#define BOARD_INITPMICPINS_PMIC_I2C_SDA_PERIPHERAL LPI2C15        /*!<@brief Peripheral name */
#define BOARD_INITPMICPINS_PMIC_I2C_SDA_SIGNAL SDA                /*!<@brief Signal name */
                                                                  /* @} */

/*! @name PIO7_14 (coord V2), U82L[V2]/U35[E4]
  @{ */
/* Routed pin properties */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL0_PERIPHERAL GPIO7          /*!<@brief Peripheral name */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL0_SIGNAL GPIO               /*!<@brief Signal name */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL0_CHANNEL 14                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL0_GPIO GPIO7                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL0_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL0_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL0_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL0_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO7_15 (coord V1), U82L[V1]/U35[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL1_PERIPHERAL GPIO7          /*!<@brief Peripheral name */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL1_SIGNAL GPIO               /*!<@brief Signal name */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL1_CHANNEL 15                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL1_GPIO GPIO7                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL1_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL1_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL1_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL1_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO7_16 (coord T1), U82L[T1]/U35[C5]
  @{ */
/* Routed pin properties */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL2_PERIPHERAL GPIO7          /*!<@brief Peripheral name */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL2_SIGNAL GPIO               /*!<@brief Signal name */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL2_CHANNEL 16                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL2_GPIO GPIO7                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL2_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL2_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL2_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPMICPINS_PMIC_DVS_CTRL2_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPMICPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

