nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
#define IOPCTL_PIO_ANAMUX_EN 0x0200u      /*!<@brief Analog mux is enabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO10_8 (coord Y6), U82N[Y6]/U66[4]/J7[7]
  @{ */
/* Routed pin properties */
#define BOARD_INITCMPPINS_DMIC_CLK_PERIPHERAL ACMP0              /*!<@brief Peripheral name */
#define BOARD_INITCMPPINS_DMIC_CLK_SIGNAL IN                     /*!<@brief Signal name */
#define BOARD_INITCMPPINS_DMIC_CLK_CHANNEL 1                     /*!<@brief Signal channel */
#define BOARD_INITCMPPINS_DMIC_CLK_PORT 10U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_INITCMPPINS_DMIC_CLK_PIN 8U                        /*!<@brief PORT pin number */
#define BOARD_INITCMPPINS_DMIC_CLK_PIN_MASK (1U << 8U)           /*!<@brief PORT pin mask */
                                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCMPPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC6 0x06u            /*!<@brief Selects pin function 6 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_14 (coord V24), U82E[V24]/U68A[59]
  @{ */
/* Routed pin properties */
#define BOARD_INITVDD2_CLKOUTPINS_SAI2_RXD0_PERIPHERAL CLKCTL0         /*!<@brief Peripheral name */
#define BOARD_INITVDD2_CLKOUTPINS_SAI2_RXD0_SIGNAL CLKOUT_VDD          /*!<@brief Signal name */
#define BOARD_INITVDD2_CLKOUTPINS_SAI2_RXD0_CHANNEL 2                  /*!<@brief Signal channel */
#define BOARD_INITVDD2_CLKOUTPINS_SAI2_RXD0_PORT 0U                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITVDD2_CLKOUTPINS_SAI2_RXD0_PIN 14U                    /*!<@brief PORT pin number */
#define BOARD_INITVDD2_CLKOUTPINS_SAI2_RXD0_PIN_MASK (1U << 14U)       /*!<@brief PORT pin mask */
                                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitVDD2_CLKOUTPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO2_0 (coord P25), U82G[P25]/J64[5]/J53[18]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_I2CPINS_FXIO_D0_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_I2CPINS_FXIO_D0_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_I2CPINS_FXIO_D0_CHANNEL 0
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_I2CPINS_FXIO_D0_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_I2CPINS_FXIO_D0_PIN 0U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_I2CPINS_FXIO_D0_PIN_MASK (1U << 0U)
/* @} */

/*! @name PIO2_1 (coord M23), U82G[M23]/J64[6]/J53[7]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_I2CPINS_FXIO_D1_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_I2CPINS_FXIO_D1_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_I2CPINS_FXIO_D1_CHANNEL 1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_I2CPINS_FXIO_D1_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_I2CPINS_FXIO_D1_PIN 1U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_I2CPINS_FXIO_D1_PIN_MASK (1U << 1U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_I2CPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO2_0 (coord P25), U82G[P25]/J64[5]/J53[18]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_UARTPINS_FXIO_D0_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_UARTPINS_FXIO_D0_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_UARTPINS_FXIO_D0_CHANNEL 0
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_UARTPINS_FXIO_D0_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_UARTPINS_FXIO_D0_PIN 0U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_UARTPINS_FXIO_D0_PIN_MASK (1U << 0U)
/* @} */

