nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
/*! @name PIO2_1 (coord M23), U82G[M23]/J64[6]/J53[7]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_UARTPINS_FXIO_D1_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_UARTPINS_FXIO_D1_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_UARTPINS_FXIO_D1_CHANNEL 1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_UARTPINS_FXIO_D1_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_UARTPINS_FXIO_D1_PIN 1U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_UARTPINS_FXIO_D1_PIN_MASK (1U << 1U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_UARTPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO2_7 (coord K24), U82G[K24]/J64[8]/J22[1]/J53[16]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_PWMPINS_FXIO_D7_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_PWMPINS_FXIO_D7_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_PWMPINS_FXIO_D7_CHANNEL 7
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_PWMPINS_FXIO_D7_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_PWMPINS_FXIO_D7_PIN 7U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_PWMPINS_FXIO_D7_PIN_MASK (1U << 7U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_PWMPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO2_0 (coord P25), U82G[P25]/J64[5]/J53[18]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D0_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D0_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D0_CHANNEL 0
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D0_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D0_PIN 0U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D0_PIN_MASK (1U << 0U)
/* @} */

/*! @name PIO2_1 (coord M23), U82G[M23]/J64[6]/J53[7]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D1_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D1_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D1_CHANNEL 1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D1_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D1_PIN 1U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D1_PIN_MASK (1U << 1U)
/* @} */

/*! @name PIO2_14 (coord K22), U82G[K22]/J64[3]/J11[2]/J53[19]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D14_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D14_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D14_CHANNEL 14
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D14_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D14_PIN 14U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D14_PIN_MASK (1U << 14U)
/* @} */

/*! @name PIO2_15 (coord K21), U82G[K21]/J64[4]/J11[1]/J53[8]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D15_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D15_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D15_CHANNEL 15
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D15_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D15_PIN 15U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_SPIPINS_FXIO_D15_PIN_MASK (1U << 15U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_SPIPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPIPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

