nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
#define IOPCTL_PIO_ANAMUX_EN 0x0200u      /*!<@brief Analog mux is enabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO10_0 (number AE2), U82N[AE2]/J24[1]
  @{ */
/* Routed pin properties */
#define BOARD_INITADCPINS_UNO_P10_0_ADC0_A0_PERIPHERAL ADC0          /*!<@brief Peripheral name */
#define BOARD_INITADCPINS_UNO_P10_0_ADC0_A0_SIGNAL CH                /*!<@brief Signal name */
#define BOARD_INITADCPINS_UNO_P10_0_ADC0_A0_CHANNEL 0                /*!<@brief Signal channel */
#define BOARD_INITADCPINS_UNO_P10_0_ADC0_A0_PORT 10U                 /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADCPINS_UNO_P10_0_ADC0_A0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_UNO_P10_0_ADC0_A0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADCPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO10_8 (coord Y6), U82N[Y6]/U66[4]/J7[7]
  @{ */
/* Routed pin properties */
#define BOARD_INITDMICPINS_DMIC_CLK_PERIPHERAL PDM                /*!<@brief Peripheral name */
#define BOARD_INITDMICPINS_DMIC_CLK_SIGNAL CLK                    /*!<@brief Signal name */
#define BOARD_INITDMICPINS_DMIC_CLK_PORT 10U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDMICPINS_DMIC_CLK_PIN 8U                        /*!<@brief PORT pin number */
#define BOARD_INITDMICPINS_DMIC_CLK_PIN_MASK (1U << 8U)           /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO10_9 (coord Y5), U82N[Y5]/U66[1]/J7[4]
  @{ */
/* Routed pin properties */
#define BOARD_INITDMICPINS_DMIC_DATA01_PERIPHERAL PDM                /*!<@brief Peripheral name */
#define BOARD_INITDMICPINS_DMIC_DATA01_SIGNAL DATA                   /*!<@brief Signal name */
#define BOARD_INITDMICPINS_DMIC_DATA01_CHANNEL 0                     /*!<@brief Signal channel */
#define BOARD_INITDMICPINS_DMIC_DATA01_PORT 10U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDMICPINS_DMIC_DATA01_PIN 9U                        /*!<@brief PORT pin number */
#define BOARD_INITDMICPINS_DMIC_DATA01_PIN_MASK (1U << 9U)           /*!<@brief PORT pin mask */
                                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDMICPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC3 0x03u            /*!<@brief Selects pin function 3 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_6 (coord P21), U82E[P21]/U31[5]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITSCTIMERPINS_P0_6_I2C8_SDA_1V8_PERIPHERAL SCT0
/*!
 * @brief Signal name */
#define BOARD_INITSCTIMERPINS_P0_6_I2C8_SDA_1V8_SIGNAL OUT
/*!
 * @brief Signal channel */
#define BOARD_INITSCTIMERPINS_P0_6_I2C8_SDA_1V8_CHANNEL 6
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITSCTIMERPINS_P0_6_I2C8_SDA_1V8_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITSCTIMERPINS_P0_6_I2C8_SDA_1V8_PIN 6U
/*!
 * @brief PORT pin mask */
#define BOARD_INITSCTIMERPINS_P0_6_I2C8_SDA_1V8_PIN_MASK (1U << 6U)
/* @} */

/*! @name PIO0_7 (coord P20), U82E[P20]/U31[4]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITSCTIMERPINS_P0_7_I2C8_SCL_1V8_PERIPHERAL SCT0
/*!
 * @brief Signal name */
#define BOARD_INITSCTIMERPINS_P0_7_I2C8_SCL_1V8_SIGNAL OUT
/*!
 * @brief Signal channel */
#define BOARD_INITSCTIMERPINS_P0_7_I2C8_SCL_1V8_CHANNEL 7
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITSCTIMERPINS_P0_7_I2C8_SCL_1V8_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITSCTIMERPINS_P0_7_I2C8_SCL_1V8_PIN 7U
/*!
 * @brief PORT pin mask */
#define BOARD_INITSCTIMERPINS_P0_7_I2C8_SCL_1V8_PIN_MASK (1U << 7U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSCTimerPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

