nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
/*! @name PIO7_18 (coord T3), U82L[T3]/U68B[19]
  @{ */
/* Routed pin properties */
#define BOARD_INITWIFIPINS_SDHC1_CMD_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITWIFIPINS_SDHC1_CMD_SIGNAL USDHC_CMD          /*!<@brief Signal name */
#define BOARD_INITWIFIPINS_SDHC1_CMD_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITWIFIPINS_SDHC1_CMD_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITWIFIPINS_SDHC1_CMD_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO7_17 (coord U3), U82L[U3]/U68B[48]
  @{ */
/* Routed pin properties */
#define BOARD_INITWIFIPINS_SDHC1_CLK_PERIPHERAL USDHC1         /*!<@brief Peripheral name */
#define BOARD_INITWIFIPINS_SDHC1_CLK_SIGNAL USDHC_CLK          /*!<@brief Signal name */
#define BOARD_INITWIFIPINS_SDHC1_CLK_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITWIFIPINS_SDHC1_CLK_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITWIFIPINS_SDHC1_CLK_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO6_9 (coord A2), WL_RST
  @{ */
/* Routed pin properties */
#define BOARD_INITWIFIPINS_WL_RST_PERIPHERAL GPIO6                   /*!<@brief Peripheral name */
#define BOARD_INITWIFIPINS_WL_RST_SIGNAL GPIO                        /*!<@brief Signal name */
#define BOARD_INITWIFIPINS_WL_RST_CHANNEL 9                          /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITWIFIPINS_WL_RST_GPIO GPIO6                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITWIFIPINS_WL_RST_GPIO_PIN_MASK (1U << 9U)           /*!<@brief GPIO pin mask */
#define BOARD_INITWIFIPINS_WL_RST_PORT 6U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITWIFIPINS_WL_RST_PIN 9U                             /*!<@brief PORT pin number */
#define BOARD_INITWIFIPINS_WL_RST_PIN_MASK (1U << 9U)                /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO4_11 (coord B14), PDN
  @{ */
/* Routed pin properties */
#define BOARD_INITWIFIPINS_PDN_PERIPHERAL GPIO4                   /*!<@brief Peripheral name */
#define BOARD_INITWIFIPINS_PDN_SIGNAL GPIO                        /*!<@brief Signal name */
#define BOARD_INITWIFIPINS_PDN_CHANNEL 11                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITWIFIPINS_PDN_GPIO GPIO4                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITWIFIPINS_PDN_GPIO_PIN_MASK (1U << 11U)          /*!<@brief GPIO pin mask */
#define BOARD_INITWIFIPINS_PDN_PORT 4U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITWIFIPINS_PDN_PIN 11U                            /*!<@brief PORT pin number */
#define BOARD_INITWIFIPINS_PDN_PIN_MASK (1U << 11U)               /*!<@brief PORT pin mask */
                                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitWIFIPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO2_0 (coord P25), U82G[P25]/J64[5]/J53[18]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D0_PERIPHERAL GPIO2
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D0_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D0_CHANNEL 0

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D0_GPIO GPIO2
/*!
 * @brief GPIO pin mask */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D0_GPIO_PIN_MASK (1U << 0U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D0_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D0_PIN 0U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D0_PIN_MASK (1U << 0U)
/* @} */

/*! @name PIO2_1 (coord M23), U82G[M23]/J64[6]/J53[7]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D1_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D1_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D1_CHANNEL 1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D1_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D1_PIN 1U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D1_PIN_MASK (1U << 1U)
/* @} */

/*! @name PIO2_6 (coord K25), U82G[K25]/J64[7]/J53[15]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D6_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D6_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D6_CHANNEL 6
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D6_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D6_PIN 6U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D6_PIN_MASK (1U << 6U)
/* @} */

/*! @name PIO2_7 (coord K24), U82G[K24]/J64[8]/J22[1]/J53[16]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D7_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D7_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D7_CHANNEL 7
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D7_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D7_PIN 7U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D7_PIN_MASK (1U << 7U)
/* @} */

/*! @name PIO2_8 (coord J23), U82G[J23]/J6[1]/J53[13]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D8_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D8_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D8_CHANNEL 8
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D8_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D8_PIN 8U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D8_PIN_MASK (1U << 8U)
/* @} */

/*! @name PIO2_9 (coord M25), U82G[M25]/J6[2]/J53[14]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D9_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D9_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D9_CHANNEL 9
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D9_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D9_PIN 9U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D9_PIN_MASK (1U << 9U)
/* @} */

/*! @name PIO2_10 (coord K23), U82G[K23]/J53[11]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D10_PERIPHERAL FLEXIO         /*!<@brief Peripheral name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D10_SIGNAL IO                 /*!<@brief Signal name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D10_CHANNEL 10                /*!<@brief Signal channel */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D10_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D10_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D10_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

