nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
/*! @name PIO2_11 (coord H25), U82G[H25]/J53[12]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D11_PERIPHERAL FLEXIO         /*!<@brief Peripheral name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D11_SIGNAL IO                 /*!<@brief Signal name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D11_CHANNEL 11                /*!<@brief Signal channel */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D11_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D11_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D11_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO2_12 (coord H24), U82G[H24]/J53[9]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D12_PERIPHERAL FLEXIO         /*!<@brief Peripheral name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D12_SIGNAL IO                 /*!<@brief Signal name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D12_CHANNEL 12                /*!<@brief Signal channel */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D12_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D12_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D12_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO2_13 (coord H23), U82G[H23]/J53[10]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D13_PERIPHERAL FLEXIO         /*!<@brief Peripheral name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D13_SIGNAL IO                 /*!<@brief Signal name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D13_CHANNEL 13                /*!<@brief Signal channel */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D13_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D13_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D13_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO2_15 (coord K21), U82G[K21]/J64[4]/J11[1]/J53[8]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D15_PERIPHERAL FLEXIO
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D15_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D15_CHANNEL 15
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D15_PORT 2U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D15_PIN 15U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXIO_CAMERAPINS_FXIO_D15_PIN_MASK (1U << 15U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_CAMERAPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
